## Plan for scanners/owasp-zap
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
iam.tf
```




```terraform
Plan: 21 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.zap_runner_container_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zap_runner_container_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:507252742351:function:scan-websites*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ec2:ca-central-1:507252742351:network-interface/*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeNetworkInterfaces",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.zap_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zap_runner_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeTaskDefinition",
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.template_file.scanning_tools will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scanning_tools"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "S3_BUCKET"
                          + value = "${s3_name}"
                        },
                      + {
                          + name  = "ZAP_PORT"
                          + value = "8080"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = null
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + command          = [
                      + "zap.sh",
                      + "-daemon",
                      + "-host",
                      + "0.0.0.0",
                      + "-port",
                      + "8080",
                      + "-config",
                      + "api.disablekey=true",
                      + "-config",
                      + "api.addrs.addr.name=.*",
                      + "-config",
                      + "api.addrs.addr.regex=true",
                    ]
                  + cpu              = 1024
                  + environment      = []
                  + essential        = true
                  + image            = "owasp/zap2docker-stable"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + memory           = 3072
                  + mountPoints      = []
                  + name             = "zap2docker"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 8090
                          + hostPort      = 8090
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/zap_runner_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-zap-runner"
          + "image"                 = (known after apply)
          + "name"                  = "zap_runner"
          + "s3_name"               = "scan-websites-owasp-zap-report-data"
        }
    }

  # aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/zap_runner_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.scanners-owasp-zap will be created
  + resource "aws_ecr_repository" "scanners-owasp-zap" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-websites/scanners/owasp-zap"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.scanning_tools will be created
  + resource "aws_ecs_cluster" "scanning_tools" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "scanning-tools"
      + tags_all = (known after apply)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.zap_runner will be created
  + resource "aws_ecs_task_definition" "zap_runner" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "zap_runner"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "scan-websites-production"
        }
      + tags_all                 = {
          + "CostCentre" = "scan-websites-production"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.scanners-owasp-zap will be created
  + resource "aws_iam_policy" "scanners-owasp-zap" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-websites-scanners-owasp-zap"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.zap_runner_policies will be created
  + resource "aws_iam_policy" "zap_runner_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "OWASPZapTaskExecutionPolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.container_execution_role will be created
  + resource "aws_iam_role" "container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.scanners-owasp-zap will be created
  + resource "aws_iam_role" "scanners-owasp-zap" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-websites-scanners-owasp-zap"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security_tools_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "scan-websites-scanners-owasp-zap"
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "container_execution_role"
    }

  # aws_iam_role_policy_attachment.cloudwatch_policies will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "security_tools_execution_role"
    }

  # aws_iam_role_policy_attachment.lambda_insights will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "scan-websites-scanners-owasp-zap"
    }

  # aws_iam_role_policy_attachment.zap_runner will be created
  + resource "aws_iam_role_policy_attachment" "zap_runner" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-websites-scanners-owasp-zap"
    }

  # aws_iam_role_policy_attachment.zap_runner_policies will be created
  + resource "aws_iam_role_policy_attachment" "zap_runner_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "security_tools_execution_role"
    }

  # aws_s3_bucket.owasp-zap-report-data will be created
  + resource "aws_s3_bucket" "owasp-zap-report-data" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-owasp-zap-report-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.owasp-zap-report-data will be created
  + resource "aws_s3_bucket_public_access_block" "owasp-zap-report-data" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.security_tools_web_scanning will be created
  + resource "aws_security_group" "security_tools_web_scanning" {
      + arn                    = (known after apply)
      + description            = "Web access for Security Scanners"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-security-scanners-sg "
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "scan-websites"
        }
      + tags_all               = {
          + "CostCenter" = "scan-websites"
        }
      + vpc_id                 = "vpc-095a761b6add80a7b"
    }

  # aws_security_group_rule.web_port_443_egress will be created
  + resource "aws_security_group_rule" "web_port_443_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Security group rule for egress to port 443"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.web_port_80_egress will be created
  + resource "aws_security_group_rule" "web_port_80_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Security group rule for egress to port 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_sns_topic.owasp-zap-urls will be created
  + resource "aws_sns_topic" "owasp-zap-urls" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "owasp-zap-urls"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + owasp_zap_report_data_bucket_id = (known after apply)
  + owasp_zap_urls_topic_arn        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>